gitpan/zxid/c/saml2md-dec.c
  /* Process contents until '</' */
  
  ZX_START_BODY_DEC_EXT(x);
  
  while (1) {
  next_elem:
    ZX_SKIP_WS(c,x);
    if (*c->p == '<') {
    potential_tag:
      ++c->p;
      switch (*c->p) {
      case '?':  /* processing instruction */
	ERR("Processing instructions not supported. %d",0);
	ZX_PI_DEC_EXT(pi);
	return 0;
      case '!':  /* comment */
	ERR("Comments not supported. %d",0);
	ZX_COMMENT_DEC_EXT(comment);
	return 0;
      case '/':  /* close tag */
	++c->p;
	name = c->p;
	ZX_LOOK_FOR(c,'>',x);
	tok = zxmd_elem_lookup(c, name, c->p);
	if (tok != x->gg.g.tok) {
	  ERR("Mismatching close tag(%.*s)", c->p-name, name);
	  x->gg.g.err |= ZXERR_MISMATCH_CLOSE;
	  ++c->p;
	  return x;
	}
	/* Legitimate close tag. Normal exit from this function. */
	++c->p;
	x->gg.g.err &= ~ZXERR_TAG_NOT_CLOSED;
	ZX_END_DEC_EXT(x);
	return x;
      default:
	if (A_Z_a_z_(*c->p)) {
	  name = c->p;
	  for (++c->p; *c->p && !ONE_OF_6(*c->p, ' ', '>', '/', '\n', '\r', '\t'); ++c->p) ;
	  if (!c->p)
	    return 0;
	  zx_scan_xmlns(c);  /* Prescan namespaces so that token can be correctly recognized. */
	  tok = zxmd_elem_lookup(c, name, c->p);
	  switch (tok) {
          case zxmd_ds_Signature_ELEM:
            el = (struct zx_elem_s*)zxmd_DEC_ds_Signature(c);
            el->g.n = &x->Signature->gg.g;
            x->Signature = (struct zxmd_ds_Signature_s*)el;
            break;
          case zxmd_md_Extensions_ELEM:
            el = (struct zx_elem_s*)zxmd_DEC_md_Extensions(c);
            el->g.n = &x->Extensions->gg.g;
            x->Extensions = (struct zxmd_md_Extensions_s*)el;
            break;
          case zxmd_md_KeyDescriptor_ELEM:
            el = (struct zx_elem_s*)zxmd_DEC_md_KeyDescriptor(c);
            el->g.n = &x->KeyDescriptor->gg.g;
            x->KeyDescriptor = (struct zxmd_md_KeyDescriptor_s*)el;
            break;
          case zxmd_md_Organization_ELEM:
            el = (struct zx_elem_s*)zxmd_DEC_md_Organization(c);
            el->g.n = &x->Organization->gg.g;
            x->Organization = (struct zxmd_md_Organization_s*)el;
            break;
          case zxmd_md_ContactPerson_ELEM:
            el = (struct zx_elem_s*)zxmd_DEC_md_ContactPerson(c);
            el->g.n = &x->ContactPerson->gg.g;
            x->ContactPerson = (struct zxmd_md_ContactPerson_s*)el;
            break;
          case zxmd_md_ArtifactResolutionService_ELEM:
            el = (struct zx_elem_s*)zxmd_DEC_md_ArtifactResolutionService(c);
            el->g.n = &x->ArtifactResolutionService->gg.g;
            x->ArtifactResolutionService = (struct zxmd_md_ArtifactResolutionService_s*)el;
            break;
          case zxmd_md_SingleLogoutService_ELEM:
            el = (struct zx_elem_s*)zxmd_DEC_md_SingleLogoutService(c);
            el->g.n = &x->SingleLogoutService->gg.g;
            x->SingleLogoutService = (struct zxmd_md_SingleLogoutService_s*)el;
            break;
          case zxmd_md_ManageNameIDService_ELEM:
            el = (struct zx_elem_s*)zxmd_DEC_md_ManageNameIDService(c);
            el->g.n = &x->ManageNameIDService->gg.g;
            x->ManageNameIDService = (struct zxmd_md_ManageNameIDService_s*)el;
            break;
          case zxmd_md_NameIDFormat_ELEM:
            el = zxmd_DEC_simple_elem(c, tok);
            el->g.n = &x->NameIDFormat->g;
            x->NameIDFormat = el;
            break;
          case zxmd_md_SingleSignOnService_ELEM:
            el = (struct zx_elem_s*)zxmd_DEC_md_SingleSignOnService(c);
            el->g.n = &x->SingleSignOnService->gg.g;
            x->SingleSignOnService = (struct zxmd_md_SingleSignOnService_s*)el;
            break;
          case zxmd_md_NameIDMappingService_ELEM:
            el = (struct zx_elem_s*)zxmd_DEC_md_NameIDMappingService(c);
            el->g.n = &x->NameIDMappingService->gg.g;
            x->NameIDMappingService = (struct zxmd_md_NameIDMappingService_s*)el;
            break;
          case zxmd_md_AssertionIDRequestService_ELEM:
            el = (struct zx_elem_s*)zxmd_DEC_md_AssertionIDRequestService(c);
            el->g.n = &x->AssertionIDRequestService->gg.g;
            x->AssertionIDRequestService = (struct zxmd_md_AssertionIDRequestService_s*)el;
            break;
          case zxmd_md_AttributeProfile_ELEM:
            el = zxmd_DEC_simple_elem(c, tok);
            el->g.n = &x->AttributeProfile->g;
            x->AttributeProfile = el;
            break;
          case zxmd_sa_Attribute_ELEM:
            el = (struct zx_elem_s*)zxmd_DEC_sa_Attribute(c);
            el->g.n = &x->Attribute->gg.g;
            x->Attribute = (struct zxmd_sa_Attribute_s*)el;
            break;

	  default:
	    D("known element(%.*s) tok(%d) in wrong context(%d)", c->p - name, name, tok, x->gg.g.tok);
	    tok = ZX_TOK_NOT_FOUND;
	    /* fall thru to classify it as any extension */
	  case ZX_TOK_NOT_FOUND:
	    elem = zxmd_DEC_wrong_elem(c, name, c->p - name);
	    elem->gg.g.n = &x->gg.any_elem->gg.g;
	    x->gg.any_elem = elem;
	    ZX_UNKNOWN_ELEM_DEC_EXT(elem);
	    break;
	  }
	  goto next_elem;
	}
      }
      /* false alarm <, fall thru */
    }
    /* Data */
    name = c->p;
    ZX_LOOK_FOR(c,'<',x);
    ss = ZX_ZALLOC(c, struct zx_str_s);
    ss->len = c->p - name;
    ss->s = name;
    ss->g.tok = ZX_TOK_DATA;
    ss->g.n = &x->gg.content->g;
    x->gg.content = ss;
    ZX_CONTENT_DEC(ss);
    goto potential_tag;
  }
}

#undef EL_NAME
#undef EL_STRUCT
#undef EL_NS
#undef EL_TAG






/* FUNC(zxmd_DEC_md_KeyDescriptor) */

#define EL_NAME   md_KeyDescriptor
#define EL_STRUCT zxmd_md_KeyDescriptor_s
#define EL_NS     md
#define EL_TAG    KeyDescriptor

struct zxmd_md_KeyDescriptor_s* zxmd_DEC_md_KeyDescriptor(struct zx_ctx* c)
{
  int tok;
  struct zx_elem_s* el;
  struct zx_str_s* ss;
  struct zx_any_attr_s* attr;
  struct zx_any_elem_s* elem;
  char* name;
  char* data;
  char quote;
  struct zxmd_md_KeyDescriptor_s* x = ZX_ZALLOC(c, struct zxmd_md_KeyDescriptor_s);
  x->gg.g.tok = zxmd_md_KeyDescriptor_ELEM;
  x->gg.g.ns = zxmd_elems[zxmd_md_KeyDescriptor_ELEM].ns;
  ZX_START_DEC_EXT(x);

